[
  {
    "segment_id": 1,
    "sentence_indexes": [
      0,
      1,
      2
    ],
    "start_time": 0.03,
    "end_time": 4.42,
    "duration": 4.39,
    "text": "Thank you so much. It's so good to be here. Oh my gosh.",
    "total_gap": 0.76
  },
  {
    "segment_id": 2,
    "sentence_indexes": [
      3,
      4,
      5,
      6,
      7,
      8,
      9
    ],
    "start_time": 4.42,
    "end_time": 16.93,
    "duration": 12.52,
    "text": "Happy Virgo season. Yeah. That was a test. Now I know where my enemies are. Got your ass. Got your ass. I'm with you.",
    "total_gap": 5.75
  },
  {
    "segment_id": 3,
    "sentence_indexes": [
      10,
      11,
      12,
      13
    ],
    "start_time": 16.95,
    "end_time": 42.1,
    "duration": 25.15,
    "text": "I've been dabbling in astrology a bit lately because I'm not well. And I am unfortunately a Gemini. Woo! Also known as a two-faced bitch, according to my birth chart and some other people.",
    "total_gap": 3.56
  },
  {
    "segment_id": 4,
    "sentence_indexes": [
      14,
      15,
      16,
      17,
      18,
      19,
      20,
      21,
      22,
      23,
      24,
      25,
      26
    ],
    "start_time": 42.1,
    "end_time": 89.32,
    "duration": 47.22,
    "text": "What I like about astrology is that it sort of lets you surrender to something bigger than yourself, you know? A higher power. It's like religion in that way, right? You know, it reminds you you're not in charge of everything. And frankly, not everything is your fault, okay? For example, I know that the reason I can't really date anyone for more than three months has nothing to do with commitment issues. It's because I'm an air sign, you know? I don't have a fear of intimacy. I had an eclipse on my birthday. Do you understand? I'm sorry my parents did it on a crisp fall day, and now this is my personality. Take it up with the sky. Take it up with the sky.",
    "total_gap": 7.66
  },
  {
    "segment_id": 5,
    "sentence_indexes": [
      27,
      28,
      29,
      30,
      31,
      32,
      33,
      34,
      35,
      36,
      37,
      38,
      39
    ],
    "start_time": 89.32,
    "end_time": 177.63,
    "duration": 88.32,
    "text": "no I I like I I do like astrology I just think it's best paired with some therapy on the side I am in therapy anybody else in pain okay good I've been in therapy for a few years now and I'll be honest, I was really scared to start. I was skeptical. I don't come from a therapy family. We did not grow up talking about our emotions in my house. I'm the product of a religious immigrant and a real salt of the earth Midwesterner. Those are two very different people who both happen to think therapy is witchcraft. They don't get it, they don't get it. My very Christian Chinese mom will say things to me like, why would you pay a stranger to listen to your problems when the Lord's been listening for free this whole time? And then my German Irish dad from Ohio will say things like, when I'm sad, I walk into the forest. And I don't come out until I feel better, so... We just hope he returns soon. It's been weeks and we miss him a lot. I miss my dad.",
    "total_gap": 14.89
  },
  {
    "segment_id": 6,
    "sentence_indexes": [
      40,
      41,
      42,
      43,
      44,
      45,
      46,
      47,
      48,
      49
    ],
    "start_time": 177.63,
    "end_time": 210.16,
    "duration": 32.52,
    "text": "I can't help but notice there's a lot of cuties here tonight. A lot of cuties. Yeah, I feel like this is just a good time to let you all know that I am bi. Yeah! Myself, I'm by myself, I'm single. Very single. I was pretty much writing solo throughout quarantine. Any other? decorated war heroes among us. Gorgeous.",
    "total_gap": 8.24
  },
  {
    "segment_id": 7,
    "sentence_indexes": [
      50,
      51,
      52
    ],
    "start_time": 210.16,
    "end_time": 226.67,
    "duration": 16.51,
    "text": "Yeah, I'm trying to get back out there, date a little bit, you know? I'm glad the world is opening back up again because personally, I found the pandemic to be pretty tough. That's something just sort of unique and interesting about me.",
    "total_gap": 0.12
  },
  {
    "segment_id": 8,
    "sentence_indexes": [
      53,
      54,
      55,
      56,
      57,
      58,
      59,
      60,
      61,
      62,
      63,
      64,
      65,
      66,
      67,
      68
    ],
    "start_time": 226.69,
    "end_time": 300.7,
    "duration": 74.01,
    "text": "I will say though, now that I'm leaving my apartment a lot more often, I have been locking myself out a lot lately. And I'm sorry, but is anyone else furious we still do physical keys? Right? We're all just carrying little pieces of scrap metal on us at all times to sleep in our own beds at night. It's 2021. We can unlock our phones with our faces, but we're still fucking around with before Christ door technology? That's insane. We should riot. That's, oh God. I locked myself out recently and I was standing in my hallway like an idiot waiting for my landlord to come back and let me in. And literally four feet away is my living room where I have an Amazon Echo, all right? I have an evil little machine I can talk to for answers. And in that moment, through the wall, I was able to be like, Alexa, what's Zoe Kravitz's birth sign? But I couldn't get into my own goddamn home. She's a Sag, by the way. She's a Sag.",
    "total_gap": 13.99
  },
  {
    "segment_id": 9,
    "sentence_indexes": [
      69,
      70,
      71,
      72,
      73,
      74,
      75,
      76,
      77,
      78,
      79,
      80,
      81,
      82,
      83,
      84,
      85,
      86,
      87,
      88,
      89,
      90,
      91,
      92,
      93,
      94,
      95,
      96,
      97,
      98,
      99,
      100,
      101,
      102,
      103
    ],
    "start_time": 300.7,
    "end_time": 422.04,
    "duration": 121.34,
    "text": "I have been celebrating the return of gossip in all of our lives, right? Yes, absolutely, absolutely. You know, we were deprived of it for a good year and a half, and now it's coming back hot. It's back, baby. Clap it off if you also love some gossip. All of you who did not clap are lying to yourselves and everyone around you. It's true. You love it. Listen, we all like gossip. People talking to people about people. What's there not to love? I think gossip is natural. I think gossip is healthy. I think gossip is self-care. Okay, that was toxic. Toxic Gemini behavior. No, it's true. I think You know, people have been gossiping since the beginning of time. They really have. And I feel like there's this weird sexist idea that only women like to gossip. As if conspiracy theories aren't just gossip delivered confidently as fact. It's the same thing. It's the exact same. The only difference between conspiracy theories and gossip is how you say it, right? A conspiracy theorist will say something like, Hillary Clinton drinks the blood of newborn babies. Yeah, I was there. I saw it with my own eyes. No, he wasn't. But a drunk gossipy woman will be like, Well, I heard from Sasha, who heard from Terry, that Hillary may be throwing back a bit of the baby blood these days, but you didn't hear from me. You didn't hear from me. She names her sources. She gives credit where credit's due. It's just a good journalist.",
    "total_gap": 30.67
  },
  {
    "segment_id": 10,
    "sentence_indexes": [
      104,
      105,
      106,
      107,
      108,
      109,
      110,
      111,
      112,
      113,
      114,
      115,
      116
    ],
    "start_time": 422.04,
    "end_time": 484.46,
    "duration": 62.42,
    "text": "You know who I think must have been the biggest gossips of all time? Famous historical military leaders. Yeah. Genghis Khan, Napoleon, Alexander the Great. You know, you gotta be in other people's business to brutally build an empire, okay? You do. Think about it. Really, all those guys did all day was be like, what are those boys doing over there? Let's find out. You have news from the mountain? Give it to me, you know? Listen, I just think that if another grown man has ever galloped up to you on horseback with a secret message, you're a nosy bitch who lives for drama. That's all I'm saying.",
    "total_gap": 25.05
  }
]