[
  {
    "segment_id": 1,
    "sentence_indexes": [
      0,
      1,
      2,
      3,
      4,
      5,
      6,
      7
    ],
    "start_time": 0.03,
    "end_time": 48.43,
    "duration": 48.4,
    "text": "I became an ordained minister last year because I had two friends that got married, and they asked me to officiate the wedding. To legally officiate, I had to become an ordained minister. So I went online, paid $19, instantly ordained. For $19, you get the certificate, and for an extra $9, you can get a clergy parking pass. And I live in New York, I don't even own a car, but I know what a nightmare parking in the city can be. So I sprung for it and I've been loaning it out to my friends with cars for a few dollars a day. And now I understand how easily corrupted religious leaders can become. It was like, I've only been ordained minister for a year and I'm already running a very lucrative underground parking scheme for the Lord.",
    "total_gap": 8.11
  },
  {
    "segment_id": 2,
    "sentence_indexes": [
      8,
      9,
      10,
      11,
      12,
      13,
      14,
      15
    ],
    "start_time": 48.43,
    "end_time": 78.62,
    "duration": 30.19,
    "text": "I liked officiating the wedding, though. It was good to be around a wedding, because I actually got married myself three months ago. I'm three months in, and I very much like being married, but I'm still not used to wearing the wedding ring at all. Like, it doesn't feel natural on my finger. But I do like wearing a wedding ring, because it lets me know when I've had too much sodium. You know, like I don't need an app or a Fitbit or a calorie counter. It's like, oh, my left ring finger's about to fall off? Yeah, maybe I'll have a salad for lunch.",
    "total_gap": 5.59
  },
  {
    "segment_id": 3,
    "sentence_indexes": [
      16,
      17,
      18,
      19,
      20,
      21,
      22,
      23,
      24,
      25,
      26
    ],
    "start_time": 78.62,
    "end_time": 118.02,
    "duration": 39.4,
    "text": "Yeah, I don't fight with my wife a lot, but we did get into a vicious fight a few weeks ago, because one night I was trying to sleep and she ate an apple in bed. What kind of psychopath eats an apple in a silent room? Think about that. Hear it in your mind's eye. Fast asleep, woke up to what I thought was an earthquake. It was a fucking Granny Smith. I was like, what the hell is wrong with you? Take that shit to the den or eat a banana. You know how many silent fruits there are? You're gonna eat the loudest one next to a sleeping body? Can't plan a future with a sociopath like that.",
    "total_gap": 8.29
  },
  {
    "segment_id": 4,
    "sentence_indexes": [
      27,
      28,
      29,
      30,
      31,
      32,
      33,
      34,
      35,
      36,
      37
    ],
    "start_time": 118.02,
    "end_time": 160.73,
    "duration": 42.71,
    "text": "And it bothered me because I have a neural disorder called misophonia. If you don't know, misophonia is where you get like an irrational visceral rage towards one sound in particular. And for me, that is the sound of people eating. It drives me crazy. I hate the sound of chips being chewed. I hate the sound of soup being slurped. So it goes without saying that I really hate the sound of someone eating cereal, which is just something crunchy being chewed while liquid is being slurped. Like, I feel about hearing someone eat cereal the way Mike Pence feels about gay refugees. You know, it's like a combination of my two least favorite things. I don't agree with his politics, it was just a spot on analogy. Fucking relax, Brooklyn.",
    "total_gap": 7.42
  },
  {
    "segment_id": 5,
    "sentence_indexes": [
      38,
      39,
      40,
      41,
      42,
      43,
      44,
      45,
      46
    ],
    "start_time": 160.73,
    "end_time": 216.79,
    "duration": 56.06,
    "text": "I don't know. My friends have told me, though, that I should use exposure therapy to get over misophonia. They think that if I'm exposed to the sounds that I don't like, I'll stop being annoyed by them. But I know exposure therapy doesn't work for me because I've been exposed to things that I don't like in the past, and it backfired horribly. Like, I'm not joking, and I don't know why, but I'm serious when I tell you that my biggest fear on Earth is conjoined twins. The connected people, they scared the shit out of me. About 10 years ago, I was in line at a fast food restaurant, thought I saw conjoined twins walking in, passed out cold on the spot. Turns out it was just two young girls sharing a coat, but I saw two heads in one coat and passed out. When I woke up and saw they were two separate human beings, I finally calmed down until I heard how loud they were eating their food.",
    "total_gap": 9.99
  },
  {
    "segment_id": 6,
    "sentence_indexes": [
      47,
      48,
      49
    ],
    "start_time": 216.79,
    "end_time": 250.54,
    "duration": 33.75,
    "text": "I've talked about this on certain shows, though, and after some shows, I've occasionally had people actually come up and point out to me that in certain Asian cultures, you're encouraged to chew with your mouth open because it's seen as a sign of respect to the chef, letting them know that you appreciate the flavor of the food, so you eat loudly to let them know that. And I want to be culturally sensitive, so that's why, to avoid losing my temper in public, whenever I see someone chewing with their mouth open, I just pretend they're Asian. No matter what, see a white dude chewing his mouth wide open, I'm just like, that albino Korean respects this chef.",
    "total_gap": 2.39
  },
  {
    "segment_id": 7,
    "sentence_indexes": [
      50,
      51,
      52,
      53,
      54,
      55,
      56,
      57,
      58
    ],
    "start_time": 250.54,
    "end_time": 279.54,
    "duration": 29.0,
    "text": "I can feel you guys tightening up on me. And it's okay. It doesn't bother me. I'm used to this, because any time you do racial material in America, people get sensitive, because racial tensions are high in America. And I do think a lot of the reason there is so much racial tension in America is because most Americans don't interact with people different than themselves. Like, not everyone lives in a diverse city. Most Americans live in really small, homogenous populations, And you can tell they don't have to interact with people different than themselves. And I do think that contributes to a lot of the racial tension that we see.",
    "total_gap": 1.06
  },
  {
    "segment_id": 8,
    "sentence_indexes": [
      59,
      60,
      61,
      62,
      63,
      64,
      65,
      66,
      67,
      68,
      69,
      70,
      71
    ],
    "start_time": 279.54,
    "end_time": 349.23,
    "duration": 69.68,
    "text": "And I mean this from the bottom of my heart when I say I think you should never hate someone based on their race. That's truly what I think. I think you should never hate someone based on their race. However, I do think you should hate at least one person from every race. Because if you don't hate at least one person from a particular race, you obviously just don't know enough people from that race. Like every group of people has some bad apples. If you can't think of at least one that you don't like, that just speaks to a lack of exposure. Which means that your overly loving opinion is still coming from a place of ignorance. So in a very weird way, if you don't hate at least one person from every race, you're kind of racist. That joke didn't do well, and I will refuse to have them remove it from my set because I'm not, I don't give a fuck, I'm not wrong. This just 90% white crowd in Brooklyn was not prepared for the mirror that I just held up to you motherfuckers. Don't clap now, you had your opportunity to like the joke. Fuck off, we are not on the same team anymore, but I don't care, I'll finish this goddamn set.",
    "total_gap": 15.29
  },
  {
    "segment_id": 9,
    "sentence_indexes": [
      72,
      73,
      74,
      75,
      76,
      77,
      78,
      79,
      80,
      81
    ],
    "start_time": 349.23,
    "end_time": 390.69,
    "duration": 41.46,
    "text": "Race issues, class issues as well. May as well go in now. No, I feel like over the last few years in America, we've also decided across the board that we hate rich kids, which feels weird to me. Like if they're assholes about it, yeah. If they're the type of rich kid that'll like challenge you to a ski race for the rights of their father's mountain, then that's a hateable rich kid for sure. But if they're otherwise really nice, hardworking individuals who just happen to have wealthy parents, then what did they do wrong? You know? We hate rich kids, but we don't hate lottery winners. And in both cases, it just comes down to being lucky. It's like, why is it okay to be lucky in a 7-Eleven and not in your father's ball sack?",
    "total_gap": 7.7
  },
  {
    "segment_id": 10,
    "sentence_indexes": [
      82,
      83,
      84,
      85,
      86,
      87,
      88,
      89,
      90,
      91,
      92,
      93,
      94,
      95,
      96,
      97
    ],
    "start_time": 390.69,
    "end_time": 460.75,
    "duration": 70.07,
    "text": "No, but there are a lot of class issues. They are legitimate, and I am sensitive to them. A lot of jobs don't get paid what they deserve, and that's problematic. The number one job that people cite is teachers. Obviously, teachers deserve way more. The problem is when people are arguing on behalf of teachers getting paid more, they always use the wrong example. The most common cliche we hear is, it's a shame how much athletes make versus how much teachers make. We've all heard that, right? I used to be a teacher. I'll be the first person to tell you teachers deserve way more money, no doubt about it, but it has nothing to do with how much athletes get paid. Those are two completely separate arguments. The fact is, for the most part, in America, people get paid according to the scarcity of their skill set. And there simply are way more people mentally capable of teaching children how to read than there are people physically capable of dunking a basketball. So if we want to narrow the wage gap, we don't need to raise teachers' pay, we need to lower the rims. Just saying, make the hoop eight feet tall. LeBron's making 60 grand next year, so.",
    "total_gap": 17.69
  }
]