[
  {
    "segment_id": 1,
    "sentence_indexes": [
      0,
      1,
      2,
      3,
      4,
      5
    ],
    "start_time": 3.36,
    "end_time": 34.77,
    "duration": 31.42,
    "text": "From New York City, Comedy Central presents... Bill Burr! All right, thank you. Thank you very much. All right, nice, nice. Nice to be here. It's a beautiful theater here.",
    "total_gap": 2.57
  },
  {
    "segment_id": 2,
    "sentence_indexes": [
      6,
      7,
      8,
      9,
      10,
      11,
      12,
      13,
      14,
      15,
      16,
      17,
      18,
      19,
      20,
      21,
      22,
      23
    ],
    "start_time": 34.82,
    "end_time": 79.92,
    "duration": 45.1,
    "text": "I didn't do anything today. I'm a loser, man. You know what I was doing? I was sitting around, I was watching that show, MTV Cribs. You guys know that show? You know the show where they show all the rock stars and the rappers' houses and all their stuff? Doesn't that show make you feel like a loser? Kills my self-esteem. I'm sitting there watching Britney Spears. She's like 20 years old. She's like, oh my God, this is my helicopter. I had it spray painted pink to match my top today. So cool. I put some glitter on the part. We're going to fly up to the house. I'm like 34 sitting on a futon eating macaroni and cheese. Like, oh my God, I'm a loser. I'll never own a helicopter.",
    "total_gap": 10.0
  },
  {
    "segment_id": 3,
    "sentence_indexes": [
      24,
      25,
      26,
      27,
      28,
      29,
      30,
      31,
      32,
      33
    ],
    "start_time": 79.92,
    "end_time": 108.72,
    "duration": 28.8,
    "text": "You know what I love about that show, though? All they're doing is showing you what not to do when you get rich. Seriously, because none of those people are saving their money. Half of them, all they have is one-hit albums, so should they really be buying all of that stuff? 20-room house, 17 cars. It's just like, dude, don't you watch Behind the Music? Haven't you learned anything from that program? You're gonna be smoking crack in like six weeks. Save your money. No, they're dumb.",
    "total_gap": 7.95
  },
  {
    "segment_id": 4,
    "sentence_indexes": [
      34,
      35,
      36,
      37,
      38,
      39,
      40,
      41,
      42,
      43
    ],
    "start_time": 108.78,
    "end_time": 147.98,
    "duration": 39.2,
    "text": "I tell you right now, man, if you want to know how to be rich, don't look at a rapper, don't look at a rock star. Look at a guy like Bill Gates. That dude is so good at being rich, it's, like, irritating. He makes, like, $30 million a day. And look at him. He dresses like he works in, like, a shoe store. But that's why he's always gonna be rich. He's not showing off, trying to, like, buy all this flashy stuff, like, walking around with, like, an iced-out laptop medallion hanging off his neck. Have some fuzzy pimp hat to the side, sitting in a hot tub with some bitches, you know? Have a midget in his crew just for the hell of it.",
    "total_gap": 9.62
  },
  {
    "segment_id": 5,
    "sentence_indexes": [
      44,
      45,
      46,
      47,
      48,
      49,
      50,
      51,
      52
    ],
    "start_time": 147.98,
    "end_time": 178.13,
    "duration": 30.16,
    "text": "Have you noticed that's the new status symbol of rich people? Midgets. I'm serious. No entourage is complete now unless you have a midget. And you know what? That's good for midgets. Seriously, because historically, those people have not gotten good jobs. Even when they book a movie, they never get to be the lead, never get to be the hero. They always got to play like a troll or a fairy, running out from under a bridge, biting on somebody's leg.",
    "total_gap": 9.93
  },
  {
    "segment_id": 6,
    "sentence_indexes": [
      53,
      54,
      55,
      56,
      57,
      58,
      59,
      60,
      61,
      62,
      63,
      64,
      65,
      66,
      67,
      68,
      69,
      70,
      71,
      72,
      73,
      74,
      75,
      76,
      77,
      78
    ],
    "start_time": 178.13,
    "end_time": 252.51,
    "duration": 74.38,
    "text": "So I was listening to George Bush today. You guys like George? No? Yes? No? I like George. You know what I like about George Bush? He makes me feel like I could be president too. Oh, he does. He's like the first guy, like, from my reading level, you know, like, the first guy, like, from my math class to finally go out and do something. You know what I love about George? He can't say the word terror. He can't. He uses the word every speech. He can't say terror. He goes, terror. That's what he says. He goes, America will not stand for terror. Anybody who supports terror, if you're a terrorist... We're going to get you. What kind of president goes, we're going to get you? He's like some redneck they dragged out of a barbecue, put him in a suit. Yo, if you're standing on stage going, we're going to get you, you should just be up there with a couple of bloodhounds going, go get him, blue. Smell the shirt. Go get him. Damn, that blue's a good dog.",
    "total_gap": 28.35
  },
  {
    "segment_id": 7,
    "sentence_indexes": [
      79,
      80,
      81,
      82,
      83,
      84,
      85,
      86,
      87,
      88,
      89,
      90,
      91,
      92,
      93,
      94,
      95,
      96,
      97
    ],
    "start_time": 252.52,
    "end_time": 322.23,
    "duration": 69.71,
    "text": "I'll tell you one thing I have realized, though. When you go to war, man, that's the one time when you really have to, like, appreciate rednecks, though. No, you know why? Because rednecks, they're like the one group of people that actually want to go to war. Everybody else tries to get out of it. Like, rich people never go to war. You ask a college kid if he wants to go to war, he's just like, um, I'm taking a sociology class, and I think war is, like, really stupid. My roommate's, like, half Afghani, so that's going to cause some static. You ask a redneck if he wants to go to war, he's just like, hell yeah! Absolutely, I'm ready right now. You just point the direction, buddy, I'm ready to do this. No, they're frightening people, but you gotta utilize them. Seriously, you wanna scare the enemy, okay? And rednecks are like America's pit bulls. They should just sedate those people, drop them off in Afghanistan, just let them run wild. Just be like, dude, just go do everything you ever dreamed of doing. Just go crazy. Have one of your friends play the banjo. It'll scare the hell out of them.",
    "total_gap": 12.77
  },
  {
    "segment_id": 8,
    "sentence_indexes": [
      98,
      99,
      100,
      101,
      102,
      103,
      104,
      105,
      106,
      107,
      108,
      109,
      110,
      111,
      112,
      113,
      114,
      115,
      116
    ],
    "start_time": 322.25,
    "end_time": 371.84,
    "duration": 49.59,
    "text": "Seriously, you wouldn't want to draft a guy like me. I'm a comedian. I'm useless. I'm a coward. I don't like confrontations. You draft a redneck, not only is that dude a psycho, he'll actually save you money. Those guys show up to the army like, here's your M16. They're like, I already got one. I got some stuff in the trunk you ain't ever seen before, buddy. I went on the internet, got me some of that surface-to-air stuff, took it out hunting, got me a moose and a duck at the same time. I didn't even see the duck. Duck was over her. I'm aiming at the moose. Duck's over her. That's my peripheral. Over her. And the shot went up the moose's ass, and the shrapnel from his antler hit the duck. Duck came down. It was the best damn duck ever, right?",
    "total_gap": 11.77
  },
  {
    "segment_id": 9,
    "sentence_indexes": [
      117,
      118,
      119,
      120,
      121,
      122,
      123,
      124,
      125,
      126,
      127,
      128,
      129,
      130,
      131,
      132,
      133,
      134,
      135,
      136,
      137,
      138,
      139,
      140,
      141,
      142,
      143,
      144,
      145,
      146,
      147,
      148,
      149,
      150,
      151,
      152,
      153,
      154,
      155,
      156,
      157,
      158
    ],
    "start_time": 371.84,
    "end_time": 473.43,
    "duration": 101.59,
    "text": "So, anywho, I took the subway here this evening. I hate taking the subway because I have a very, like, howdy-doody, kind of mug me kind of face. No, people tend to mess with me when I'm on the train, you know? So I don't look at anybody when I'm on the train. I just, like, stare at the floor, you know? This is a true story. One night, I'm sitting there. I'm staring at the floor. There's, like, 20 other people in the middle of the train. All of a sudden, I hear this lady's voice at the back of the train. I swear to God, she's sitting there. She's going, she's going, let go of my neck. I swear to God, she's like, ow! You're hurting me! Let go of my neck! And you know how it's like you don't want to look when some stuff like that's happening? You know, you try to ignore it, you're just sitting there going like, settle that! Make it go away! Don't want to see the rest of that! But it just keeps going. She's going, I said, ow! You're hurting me! So finally, I got to look. I look down. I swear to God, man, this dude has got his girl, like, right by the back of the neck. He's going, you shut the hell up. You shut up. She's like, ah! Shut up. Ah! So I don't know what the hell to do, you know? Because it's like, I really want to help her out, but I don't really know how to fight. So what am I going to do? I'm going to walk down the end of the train. Five seconds later, I'm going to be going, ah! I was just trying to help. So I didn't do a damn thing. I didn't. I just sat there. I was like, to hell with her. She picked them. It's not my problem.",
    "total_gap": 26.8
  },
  {
    "segment_id": 10,
    "sentence_indexes": [
      159,
      160,
      161,
      162,
      163,
      164,
      165,
      166,
      167,
      168,
      169,
      170,
      171,
      172
    ],
    "start_time": 473.43,
    "end_time": 523.15,
    "duration": 49.72,
    "text": "I don't know if she's into that kind of thing, but... So I was watching a little bit of Oprah the other night. I don't really like that show. My girlfriend likes it, and I want to get laid, so, you know. No, no, you pick your battles. You know what I like about that show? They always examine relationships on that show. You know what I realized? Whenever they do it on those talk shows, 90% of the time, the dude is always wrong. It's unbelievable. Two people, 90% of the time, guy's always wrong. This woman is always totally innocent, like, I was just trying to make him some chocolate chip cookies, and he didn't think there was enough chocolate chips in the cookies, so he started beating me with the cookie pan. It was horrible. And the guy's like always the biggest moron ever, like, well, what? I wanted some cookies.",
    "total_gap": 10.28
  },
  {
    "segment_id": 11,
    "sentence_indexes": [
      173,
      174,
      175,
      176,
      177,
      178,
      179,
      180,
      181,
      182,
      183,
      184,
      185,
      186,
      187,
      188
    ],
    "start_time": 523.15,
    "end_time": 568.67,
    "duration": 45.52,
    "text": "Now, I'm not saying guys aren't jerks. I'm a good example of one. You know what I'm saying? But women can be jerks too. They should balance it out. Like, you know what group of women I'd love them to do a show on? Are those 24, 25-year-old gorgeous women who will go out and like hook up and marry like an 80-year-old rich guy. You ever seen them hanging out with, like, Hugh Hefner, some 70-year-old guy in his pajamas? Now, if they were just honest about it and were like, look, this guy's gonna die in, like, seven or eight minutes. I'm gonna get a bag of cash and a Lexus. I wouldn't have a problem with it. But they always try and lie and be like, no, I love him for who he is. It has nothing to do with the big yacht. There's just something about the way he drools in his bathrobe as he pushes the checkers along. It's really enjoyable. You just wanna be like, lady, you're humping him for his money.",
    "total_gap": 6.82
  },
  {
    "segment_id": 12,
    "sentence_indexes": [
      189,
      190,
      191,
      192,
      193,
      194,
      195,
      196,
      197,
      198,
      199,
      200,
      201,
      202,
      203,
      204,
      205,
      206,
      207,
      208,
      209,
      210,
      211
    ],
    "start_time": 568.67,
    "end_time": 626.47,
    "duration": 57.8,
    "text": "See, that's something I could never do, man. If some 80-year-old billionaire, rich old lady came walking down the street, started like hitting on me, sitting like, hey there, sonny. You know, started grabbing my ass. Ooh, you're pretty firm. What are you, in the Navy or something? This big lady, get the hell away from me. Right, you're old, you're gross. You know, I'm sorry. I'm sure you were unbelievable back in the 20s when you were doing the Charleston, making beer in your bathtub, but you were at least four decades beyond humpable. I'm sorry. I'm sorry. No, how do you have sex? I don't understand. How do you have sex with somebody 40, 50 years older than you? I'll tell you the only way you can do it. You know what you got to do? You got to put the will on the headboard. No, so at any point, if you lose your nerve, you just can read some of the stuff that you're getting. You're just sitting there like, oh, my God, this is disgusting. What is becoming me? Oh, a house in Miami. Okay, I can stick this out a little bit longer. I guess this isn't as bad as I was thinking a second ago.",
    "total_gap": 13.04
  },
  {
    "segment_id": 13,
    "sentence_indexes": [
      212,
      213,
      214,
      215,
      216,
      217,
      218,
      219,
      220,
      221,
      222,
      223,
      224,
      225,
      226,
      227,
      228,
      229,
      230,
      231,
      232
    ],
    "start_time": 626.46,
    "end_time": 671.03,
    "duration": 44.57,
    "text": "Now, I got some issues, I guess. I do. I'm not going to lie to you. Like, a beautiful woman. I don't trust beautiful women. I just don't. You know why? Because you know what I've noticed in my life as a man? Beautiful women are only around when you have stuff. When your life is going on, great. They're all over the place. But when you're broke, you can't find a beautiful woman. You're like under a bridge. There's like trolls and ferrets running around. They're just not around. Then the second you get some, like you get a little money off, they come out of the woodwork like, oh my God, you have some stuff. Can you buy me some stuff? I want some stuff too. Then the second you go broke, oh my God, I left something over here next to this guy. He has stuff. I've always loved him.",
    "total_gap": 11.01
  },
  {
    "segment_id": 14,
    "sentence_indexes": [
      233,
      234,
      235,
      236,
      237,
      238,
      239,
      240,
      241,
      242,
      243,
      244,
      245,
      246,
      247,
      248,
      249,
      250,
      251,
      252,
      253,
      254,
      255,
      256,
      257,
      258,
      259,
      260
    ],
    "start_time": 671.03,
    "end_time": 758.46,
    "duration": 87.42,
    "text": "No, you know what? You haven't solidified my issues. This is what solidified it, okay? I was at a Yankees game one time, right? I'm sitting there. It was like the end of the inning, and Tino Martinez catches a foul ball to end the inning. You know how they always throw it into the crowd? There's like a hundred people going, Tino, Tino, Tino, foul, foul. There's a beautiful girl sitting right in the front row. Of course, oh, my God, I have these. Eh, I get to sit in the front row. What, this doesn't happen to everybody? So there's 100 people asking for this stupid ball. He walks right up to her, just hands it right to her. Didn't flip it, didn't toss it, handed it right to her. You know what I'd have to do in my lifetime to ever catch a foul ball? First of all, it would have to be like the one in a million chance that the ball was actually hit way the hell up where I was sitting, in like the upper, upper, upper deck. which means the ball's gonna be coming in at about 100, 120 miles an hour. So I gotta figure out, like, which body part I'm gonna sacrifice to slow it down. And then I gotta pounce on it, curl up in the fetal position as eight guys punch me in the back of the head. And I pray to God that I can hang on until security gets there. And he just walks right up and just handed them off. She probably didn't even know what it was. Like, basket? Oh, baseball. Oh, my God. Let me take this home and stick it next to my other unbelievable free things that I don't appreciate. Shelf in my house.",
    "total_gap": 17.03
  },
  {
    "segment_id": 15,
    "sentence_indexes": [
      261,
      262,
      263,
      264,
      265,
      266,
      267,
      268,
      269,
      270,
      271,
      272,
      273,
      274,
      275,
      276,
      277,
      278
    ],
    "start_time": 758.46,
    "end_time": 801.67,
    "duration": 43.22,
    "text": "So, anywho. I was taking the, uh... I don't know. You know what the greatest thing about this job is? I don't have a boss. That's what I love about this show. I never wanted a job where I had a boss. That's why I used to always work in, like, warehouses. Because if my boss gave me a rough time, I could just get on a forklift and just, like, drive away from him. You know? And I realized that was too stupid to run a business. You know what I mean? I just knew I was never going to be that guy, like, you know, in the big office, big long table, going, we know we... In the fourth quarter, we need to increase production, okay? Kathy, you're using a little bit too many paperclips, and we need to just kind of tone that down. I'm not singling you out. We're just kind of... I could never do it. So I realized the only thing I could ever do, my greatest thing I could ever do, was work in one of those cubicles. And I refused to do it.",
    "total_gap": 8.04
  },
  {
    "segment_id": 16,
    "sentence_indexes": [
      279,
      280,
      281,
      282,
      283,
      284,
      285,
      286,
      287,
      288,
      289,
      290
    ],
    "start_time": 801.68,
    "end_time": 838.57,
    "duration": 36.89,
    "text": "Cubicles should be illegal, man. You know what a cubicle basically says? It basically says, like, you know what? We don't think you're smart enough for an office, but we don't want you to look at anybody. So you're going to get in there, and you're going to shut your face. Then you just get in there and you're hunched over, typing away. Around lunchtime, you pop your head up like a gopher, like, hey, Steve, you want to get a sandwich or something? I said, get in there and shut your face. I was just asking for a sandwich or something. God, I hate that guy. I really hate that guy. It's time to go on the internet and look for a weapon.",
    "total_gap": 9.15
  },
  {
    "segment_id": 17,
    "sentence_indexes": [
      291,
      292,
      293,
      294,
      295,
      296,
      297,
      298,
      299,
      300,
      301,
      302,
      303,
      304,
      305,
      306,
      307,
      308,
      309,
      310,
      311,
      312,
      313,
      314,
      315,
      316,
      317,
      318,
      319,
      320,
      321,
      322,
      323,
      324,
      325,
      326,
      327,
      328,
      329,
      330,
      331,
      332,
      333,
      334,
      335,
      336,
      337,
      338,
      339,
      340,
      341,
      342,
      343,
      344,
      345,
      346,
      347,
      348,
      349
    ],
    "start_time": 838.57,
    "end_time": 993.21,
    "duration": 154.65,
    "text": "Pathetic, man. You know what I love about the cubicle? I always love the pathetic attempt to try to make the cubicle like a home. You know what I mean? There's always like a stuffed animal in there or like a picture of your mom with like her disappointed eyes looking back out at you like, why have you accepted this as your lot in life? Why don't you have the balls to get up and walk out of this thing? I'm telling you, those people need to be rescued. You ever walk by a cubicle? The person in the cubicle always looks back out at you. Because they're starved for some sort of human contact. They'll just start up a conversation like, hey, hey. Is it raining out? I haven't seen the sky in like six days. They don't let us look out the windows. This is a true story, man. I'm staying there, all right? Minding my own business. All right, this black guy goes to get on the train, right? All of a sudden, the door's like closed on him. You know when that happens? They kind of open and close it. It's like they're trying to like dice you up. So it's like typical New York. There's like 20 people watching, but nobody helps out. Everyone's just standing like, wow, I think it's gonna cut his arm off. So the dude's stuck in the doors, the conductor comes out, starts giving the guy a rough time as he's stuck in the doors. He's going, come on, buddy, let's go! He's like, you're holding people up? Let's go! So the dude in the door starts flipping out. He's like, what the hell are you yelling at me for? He's like, I'm stuck in the doors. Then he makes it racial. He's like, I bet you wouldn't say anything to all these crackers sitting over here. It was, like, me and three other white dudes sitting there. So he gets into it, this guy. He keeps coming back to that point. Like, I bet he wouldn't say anything to these crackers sitting over here. And after, like, the third or fourth, crackers sitting over here, me and the three white dudes kind of start, like, looking at each other, like, dude, shouldn't we, like, be getting offended at this point? This is getting ridiculous. I can literally feel the heat from his fingers. He's going, crackers sitting over here. Somebody should do something. Do you know what? Nobody did shit. We just sat there and took it. That's what sucks about being white in that situation. There's no unity. There's no brothers when it comes to white people. We are just complete individuals. We don't care about each other. It's not my brother. My brother lives in Ohio. I don't know that guy. I'm not concerned about over here. I'm concerned about from here to right here. Here. That was unbelievable. I got called a cracker for, like, 18 stops.",
    "total_gap": 38.79
  },
  {
    "segment_id": 18,
    "sentence_indexes": [
      350,
      351,
      352,
      353,
      354,
      355,
      356,
      357,
      358,
      359,
      360,
      361,
      362,
      363
    ],
    "start_time": 993.21,
    "end_time": 1034.94,
    "duration": 41.73,
    "text": "I'll tell you, that's funny, though, when someone gets racial with you when you're white, because you're not allowed to get racial back, you know what I mean? So it's kind of, like, awkward. The dude's going on, you white boy! You cracker! You're like, yeah, you stupid jerk. No, you can't get racial back, because the second you get racial back when you're white, then all of a sudden they like wheel out that podium and have like that press conference. You got to be like that guy standing up there going, I disgraced the company. I disgraced myself. I'd just like to state that there was no air conditioning on the subway. I wasn't thinking clearly. I have nothing against Mexicans. I went to Tijuana. I had a great time. Please, please don't do this.",
    "total_gap": 9.44
  },
  {
    "segment_id": 19,
    "sentence_indexes": [
      364,
      365,
      366,
      367,
      368,
      369,
      370,
      371,
      372,
      373,
      374,
      375,
      376
    ],
    "start_time": 1034.94,
    "end_time": 1063.26,
    "duration": 28.32,
    "text": "No, that's why a lot of white dudes, we can get uptight in certain social situations. We got to watch out for the podium. No, that podium can come out of nowhere. You're not even trying to say something like, yeah, I'm thinking of getting a shirt. What shirt? I'm thinking of the black shirt. What the hell did you say? I said black shirt. I should have said African-American shirt. I apologize. Please, I need this position. I have a mortgage. Please don't do this.",
    "total_gap": 6.91
  },
  {
    "segment_id": 20,
    "sentence_indexes": [
      377,
      378,
      379,
      380,
      381,
      382,
      383,
      384,
      385,
      386,
      387,
      388,
      389,
      390,
      391,
      392,
      393,
      394,
      395,
      396,
      397,
      398,
      399,
      400,
      401,
      402,
      403,
      404,
      405,
      406,
      407
    ],
    "start_time": 1063.26,
    "end_time": 1172.98,
    "duration": 109.72,
    "text": "So, anywho, I got a computer recently. That's, like, one of the biggest things in my life. I'm really trying to get, like, more, like, you know, into this whole technology thing. I'm awful with computers. I'm one of those guys, basically, every button I hit on my computer, my computer has to, like, shut down, like, regroup, somehow, like, deal with my idiocy, you know what I mean? Then there's always, like, some eight-year-old I see later on a laptop, like... He's, like, breaking into the Pentagon, downloading movies that haven't even been made yet. I just got a plane ticket for six bucks. He just wanted to, like, slam his head in the thing. I'll tell you the only thing I like about my computer is I really enjoy spellcheck. No, I love it. You know what I love about spellcheck? You don't have to be close to getting the word right. Have you ever noticed that? All you gotta do is just get it, like, somewhere, like, within the ballpark of the word. It's almost like your computer can just start guessing, like, ah, , I don't know. Dinosaur? You know, when you're sitting there like an idiot, like, nah, I wasn't trying to spell dinosaur. So then what does your computer do? It starts throwing out like every D word it can possibly think of, like, okay, how about dictionary? Diary, any of this stuff looking familiar. Are we moving towards the goal or away from it? You ever spell a word so bad, though, your spell check has absolutely no clue what the hell you're trying to spell? What do you end up getting? You end up getting like a question mark. You got a million dollars worth of technology just looking back at you like... Just like, you got me, buddy! Which is pretty amazing, because I have all the words. Yeah, and that doesn't look like any of them. I can't even make a guess that's so screwed up. Would you, like, pass out and whack your head off the keyboard? Please tell me you're not that stupid.",
    "total_gap": 19.9
  },
  {
    "segment_id": 21,
    "sentence_indexes": [
      408,
      409,
      410,
      411
    ],
    "start_time": 1172.98,
    "end_time": 1239.88,
    "duration": 66.89,
    "text": "All right, that's it for me. You guys were a lot of fun. Thank you very much. God bless you.",
    "total_gap": 62.99
  }
]