[
  {
    "segment_id": 1,
    "sentence_indexes": [
      0,
      1,
      2,
      3
    ],
    "start_time": 0.57,
    "end_time": 14.52,
    "duration": 13.95,
    "text": "Something's wrong, man. Just don't be one of these people that's surprised that black folks got issues. Them the people I can't deal with. I'd rather talk to somebody that don't agree with me than somebody that's had their eyes closed.",
    "total_gap": 1.78
  },
  {
    "segment_id": 2,
    "sentence_indexes": [
      4,
      5,
      6,
      7,
      8,
      9,
      10,
      11,
      12,
      13,
      14,
      15,
      16,
      17,
      18,
      19,
      20,
      21,
      22,
      23,
      24
    ],
    "start_time": 14.52,
    "end_time": 87.14,
    "duration": 72.62,
    "text": "Did you know black people, why are black people angry? We've been angry. This ain't new. You think this just happened in the last couple of years? Black folks been trying to tell y'all forever that they had some issues and we said, we invented the blues. What more of a sign did you need? We literally invented an entire genre of music based on sadness. That's how sad we were. The blues was created here. That is an American art form. That is not native African. You go listen to old African music. The shit is happy, because we was free. Come back. Every old African song. We're the freedom in Africa. Freedom, freedom, Africa. Freedom, freedom, Africa. as soon as we got off the slave ship. We've been sad. How the hell are you surprised?",
    "total_gap": 31.91
  },
  {
    "segment_id": 3,
    "sentence_indexes": [
      25,
      26,
      27,
      28,
      29,
      30,
      31,
      32,
      33,
      34,
      35,
      36,
      37,
      38,
      39,
      40,
      41,
      42
    ],
    "start_time": 87.14,
    "end_time": 149.39,
    "duration": 62.25,
    "text": "They're not patriotic. The black people don't like the national anthem anymore. Ain't no shock to you, man. You want to know what black folks feeling, just listen to their music. Our music tell you everything that's going on in the black psyche. It's a beautiful telegram. And nowhere in the history of black music is there a hit patriotic song. That ain't what we do. I mean, we'll cover a song, but, like, we don't write no original patriotic song. Black artists ain't nothing, because we got a conflicted relationship with the country. You can't write no honest patriotic song. You got to leave that to white artists. They ain't had a good time. They had a good time in America. You're damn right. You should be writing to patriots. And I'm proud to be in America where at least I know I'm free. They be serious.",
    "total_gap": 17.45
  },
  {
    "segment_id": 4,
    "sentence_indexes": [
      43,
      44,
      45,
      46,
      47,
      48,
      49,
      50,
      51,
      52,
      53,
      54,
      55,
      56,
      57,
      58,
      59,
      60,
      61
    ],
    "start_time": 149.39,
    "end_time": 204.54,
    "duration": 55.15,
    "text": "You couldn't possibly expect that level of patriotism from a race of people that have so many issues. You can't. It's not realistic. Black people, we don't sing about America. We sing about specific cities where you can have a good-ass time. That's what we do. We don't talk about the country. We can tell you where the party at, though. We can do that. Look, I can't tell you nothing about America, but let me tell you about the city where the heat is on all night on the beach to the early morn. Welcome to Miami. That's where you got to go. You ever been to California? Oh, my God, boy, you got to go down to California, boy. Boy, California knows how to party. The city of L.A., the city of good old Watts, and the city of Compton, they keep it rocking. Write that shit down. I'm trying to tell you. They keep it rocking.",
    "total_gap": 14.25
  },
  {
    "segment_id": 5,
    "sentence_indexes": [
      62,
      63,
      64,
      65,
      66,
      67,
      68,
      69,
      70,
      71,
      72
    ],
    "start_time": 204.54,
    "end_time": 259.54,
    "duration": 55.0,
    "text": "Black people don't do patriotism. Maybe Georgia On My Mind, that's the closest we probably come. Maybe that, maybe that. That's a good song, it's warm, it's about the country. Ray Charles, Georgia On My Mind, good song. But the key word in that song is on my mind. Ray Charles was just thinking about Georgia. He didn't tell you to go there. Georgia's like every other part of the South. It's got some pockets you should not be in after dark. If you'd have asked Ray Charles to be more specific on where in Georgia to go, he'd have said go to Atlanta where the players play and they ride on them things like every day.",
    "total_gap": 7.38
  },
  {
    "segment_id": 6,
    "sentence_indexes": [
      73,
      74,
      75,
      76,
      77,
      78,
      79,
      80,
      81,
      82,
      83,
      84
    ],
    "start_time": 259.56,
    "end_time": 311.93,
    "duration": 52.36,
    "text": "My Uncle Derek tried to shut me down on that one. What about James Brown living in America? That's patriotic. James Brown singing about America. It's original, and he black. Living in America. It's a good song, but keep it real, man. James Brown wrote that song for Rocky IV, and as soon as he finished singing it, Apollo Creed died in the ring. It's a sad song. It's a sad song. How can you here living in America not think about Apollo Creed just falling lifeless today? Michael B. Jordan lost his daddy that day.",
    "total_gap": 18.65
  },
  {
    "segment_id": 7,
    "sentence_indexes": [
      85,
      86,
      87,
      88,
      89,
      90,
      91,
      92,
      93,
      94,
      95,
      96,
      97
    ],
    "start_time": 311.93,
    "end_time": 364.74,
    "duration": 52.81,
    "text": "If anything, living in America is not patriotic. It's the opposite. It's a secret message to black people. James Brown is one of the most masterful musicians to ever walk this earth, dude. It's a brilliant song. That song ain't got nothing to do with America. That entire song, Living in America, is a secret message to black folks. All y'all do, listen to the end of the song. Very end of Living in America, all James Brown do is just start naming cities. That's it, end of the song. Living in America, New Orleans, Detroit City, Dallas, Pittsburgh, Kansas City, Atlanta. He just naming safe places for black folks. That's it.",
    "total_gap": 19.01
  }
]